Revit 2024 API
BendingDetailTypeMultipleValuesIndicatorOptions Enumeration
 Describes how the parameters with multiple values will be represented.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Since: 2024
Syntax
C#
public enum BendingDetailTypeMultipleValuesIndicatorOptions
Visual Basic
Public Enumeration BendingDetailTypeMultipleValuesIndicatorOptions
Visual C++
public enum class BendingDetailTypeMultipleValuesIndicatorOptions
Members
Member name | Description
FromOneBar |  Obtain parameter value from only one bar.
MinimumMaximum |  The values will be obtained from all included bars in the rebar set and it will be shown in a form like minimumValue...maximumValue.
See Also
Autodesk.Revit.DB.Structure Namespace